Geemal2004/Enterprise-Cargo-Monitoring-System/firmware/gateway-node/cargo_gateway_esp32.ino
// 1. DEFINES MUST COME BEFORE TinyGSM INCLUDE
#define TINY_GSM_MODEM_SIM800
#define TINY_GSM_RX_BUFFER 1024
#define TINY_GSM_DEBUG Serial
#define MQTT_MAX_PACKET_SIZE 2048

#include <Arduino.h>
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <esp_idf_version.h>
#include <TinyGsmClient.h>
#include <TinyGPSPlus.h>
#include <PubSubClient.h>
#include <SSLClient.h>
#include <HTTPUpdate.h>
#include <Update.h>
#include <ArduinoJson.h>
#include <Preferences.h>
#include "trust_anchors.h"
#include "CargoPacket.h"
#include "TimeSyncPacket.h"

// -----------------------------------------------------------------------------
// Configuration (TODO: move credentials to secure secrets storage)
// -----------------------------------------------------------------------------

// Pin map (ESP32-WROOM-32 / N4 gateway)
static const int PIN_GPS_RX = 27;
static const int PIN_GPS_TX = 26;
static const int PIN_GSM_RX = 16;
static const int PIN_GSM_TX = 17;

// Fixed identities
static const char GATEWAY_MAC_STR[] = "EC:E3:34:23:43:24";
static const char SENSOR_MAC_STR[] = "AC:A7:04:27:BD:00";
static const uint8_t SENSOR_MAC_BYTES[6] = {0xAC, 0xA7, 0x04, 0x27, 0xBD, 0x00};

// APN (Mobitel)
static const char APN[] = "mobitel";
static const char APN_USER[] = "";
static const char APN_PASS[] = "";

// EMQX Serverless endpoint and credentials
static const char MQTT_BROKER_HOST[] = "i8e0f149.ala.asia-southeast1.emqxsl.com";
static const uint16_t MQTT_BROKER_PORT = 8883;
static const char MQTT_USERNAME[] = "cabin_node";
static const char MQTT_PASSWORD[] = "6HYUvbJEkeFr9m4";

static const char WIFI_SCAN_REQUEST_TOPIC[] = "tenant/demo/truck/TRUCK01/gateway/wifi/scan/request";
static const char WIFI_SCAN_RESULT_TOPIC[] = "tenant/demo/truck/TRUCK01/gateway/wifi/scan/result";
static const char WIFI_CONNECT_TOPIC[] = "tenant/demo/truck/TRUCK01/gateway/wifi/connect";
static const char WIFI_STATUS_TOPIC[] = "tenant/demo/truck/TRUCK01/gateway/wifi/status";
static const char WIFI_SCAN_REQUEST_TOPIC_FILTER[] = "tenant/+/truck/+/gateway/wifi/scan/request";
static const char WIFI_CONNECT_TOPIC_FILTER[] = "tenant/+/truck/+/gateway/wifi/connect";
static const char OTA_COMMAND_TOPIC[] = "tenant/demo/truck/TRUCK01/ota/gateway/command";
static const char OTA_STATUS_TOPIC[] = "tenant/demo/truck/TRUCK01/ota/gateway/status";
static const char OTA_CONTAINER_CMD_TOPIC[] = "tenant/demo/truck/TRUCK01/ota/container/command";
static const char OTA_CONTAINER_STATUS_TOPIC[] = "tenant/demo/truck/TRUCK01/ota/container/status";
static const char OTA_COMMAND_TOPIC_FILTER[] = "tenant/+/truck/+/ota/gateway/command";
static const char OTA_CONTAINER_CMD_TOPIC_FILTER[] = "tenant/+/truck/+/ota/container/command";
static const size_t OTA_CHUNK_SIZE = 200;
static const uint32_t OTA_PKT_BEGIN = 0x4F544142UL;
static const uint32_t OTA_PKT_CHUNK = 0x4F54414EUL;
static const uint32_t OTA_PKT_END = 0x4F544145UL;
static const uint32_t ESP_NOW_CHANNEL_MAGIC = 0x4348414EUL; // "CHAN"

// Canonical routing
static const char TENANT_ID[] = "demo";
static const char FLEET_ID[] = "fleet-01";
static const char TRUCK_ID[] = "TRUCK01";
static const char CONTAINER_ID[] = "CONT01";
static const char MQTT_TOPIC[] = "tenant/demo/truck/TRUCK01/container/CONT01/telemetry";

// Serial and modem
static const uint32_t DEBUG_BAUD = 115200;
static const uint32_t MODEM_BAUD = 9600;
static const uint32_t GPS_BAUD = 9600;
static const size_t SERIAL_AT_RX_BUFFER_BYTES = 4096;  // must be before SerialAT.begin()
static const char FIRMWARE_BUILD[] = "FW_BUILD:gateway-ota-wifi-cancel-led-off-2026-04-26";
static const uint32_t GPS_BAUD_SCAN_INTERVAL_MS = 15000;
static const uint32_t GPS_STREAM_STALE_MS = 3000;
static const uint32_t GPS_WARMUP_MS = 90000;
static const uint32_t GPS_BAUD_CANDIDATES[] = {9600, 38400, 19200, 57600, 115200};
static const int GPS_UART_PIN_CANDIDATES[][2] = {
  {PIN_GPS_RX, PIN_GPS_TX},
  {PIN_GPS_TX, PIN_GPS_RX},
};

// Non-blocking timing
static const uint32_t RECONNECT_INTERVAL_MS = 5000;
static const uint32_t STATUS_LOG_INTERVAL_MS = 5000;
static const uint32_t MIN_PUBLISH_GAP_MS = 800;
static const uint16_t MQTT_BUFFER_BYTES = 2048;
static const uint32_t TIME_SYNC_INTERVAL_MS = 30000;
static const uint32_t MIN_VALID_UNIX_TS = 1704067200UL;
static const uint32_t WIFI_CONNECT_TIMEOUT_MS = 45000;
static const uint32_t WIFI_SCAN_TIMEOUT_MS = 30000;
static const uint16_t WIFI_SCAN_MAX_MS_PER_CHANNEL = 120;
static const uint32_t OTA_READ_TIMEOUT_MS = 15000;
static const uint32_t OTA_SUCCESS_MQTT_FLUSH_MS = 4000;
static const float SMOKE_ALERT_THRESHOLD_PPM = 500.0f;
static const uint8_t ESP_NOW_BOOT_CHANNEL = 1;

// -----------------------------------------------------------------------------
// Globals
// -----------------------------------------------------------------------------

HardwareSerial SerialAT(1);   // GSM UART1
HardwareSerial SerialGPS(2);  // GPS UART2

TinyGsm modem(SerialAT);
TinyGsmClient raw_tcp_transport(modem, 0);   // SIM800L raw TCP for MQTT/TLS
SSLClient secure_client(raw_tcp_transport, TAs, (size_t)TAs_NUM, 34);
PubSubClient mqtt_client(secure_client);

TinyGPSPlus gps;
Preferences wifiPrefs;

portMUX_TYPE packetMux = portMUX_INITIALIZER_UNLOCKED;
volatile bool packetReady = false;
volatile uint32_t rejectedMacCount = 0;
volatile uint32_t rejectedLengthCount = 0;
CargoPacket rxPacket{};

bool publishPending = false;
CargoPacket publishPacketData{};
unsigned long lastReconnectAttemptMs = 0;
unsigned long lastStatusLogMs = 0;
unsigned long lastPublishMs = 0;
unsigned long lastTimeSyncMs = 0;
unsigned long bootMs = 0;

enum WifiState {
  WIFI_IDLE,
  WIFI_SCANNING,
  WIFI_CONNECTING,
  WIFI_CONNECTED,
  WIFI_FAILED,
};

WifiState wifiState = WIFI_IDLE;
bool wifiStatusDirty = false;
bool wifiPrefsReady = false;
bool wifiScanActive = false;
unsigned long wifiScanStartedMs = 0;
unsigned long wifiConnectStartedMs = 0;
String pendingWifiSsid;
String pendingWifiPass;
String activeWifiSsid;
String scannedSsidCache[12];
uint8_t scannedChannelCache[12] = {};
String scannedBssidCache[12];
size_t scannedNetworkCacheCount = 0;
uint8_t expectedContainerChannel = ESP_NOW_BOOT_CHANNEL;
uint8_t pendingWifiChannel = 0;
uint8_t pendingWifiBssid[6] = {};
bool pendingWifiHasBssid = false;
volatile uint8_t lastWifiDisconnectReason = 0;
volatile bool wifiGotIpEventPending = false;

