Geemal2004/Enterprise-Cargo-Monitoring-System/firmware/gateway-node/cargo_gateway_esp32.ino
bool otaPending = false;
bool otaIsForContainer = false;
volatile bool otaCancelRequested = false;
char otaUrl[256] = {};
uint32_t otaExpectedSize = 0;
char otaFilename[64] = {};
String wifiTopicBase = "tenant/demo/truck/TRUCK01/gateway/wifi";
String otaGatewayTopicBase = "tenant/demo/truck/TRUCK01/ota/gateway";
String otaContainerTopicBase = "tenant/demo/truck/TRUCK01/ota/container";
uint8_t lastGatewayOtaProgress = 255;
unsigned long lastGatewayOtaProgressMs = 0;
WiFiClient *activeGatewayOtaClient = nullptr;

unsigned long gpsLastByteMs = 0;
unsigned long gpsLastBaudScanMs = 0;
uint32_t gpsActiveBaud = GPS_BAUD;
uint32_t gpsRawByteCount = 0;
size_t gpsBaudCandidateIndex = 0;
size_t gpsPinCandidateIndex = 0;
int gpsActiveRxPin = PIN_GPS_RX;
int gpsActiveTxPin = PIN_GPS_TX;

// -----------------------------------------------------------------------------
// Utility
// -----------------------------------------------------------------------------

bool macEquals(const uint8_t *a, const uint8_t *b) {
  for (int i = 0; i < 6; ++i) {
    if (a[i] != b[i]) return false;
  }
  return true;
}

String macToString(const uint8_t *mac) {
  char s[18];
  snprintf(s, sizeof(s), "%02X:%02X:%02X:%02X:%02X:%02X",
           mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  return String(s);
}

const char *wifiStateName(WifiState state) {
  switch (state) {
    case WIFI_IDLE: return "idle";
    case WIFI_SCANNING: return "scanning";
    case WIFI_CONNECTING: return "connecting";
    case WIFI_CONNECTED: return "connected";
    case WIFI_FAILED: return "failed";
    default: return "unknown";
  }
}

bool topicMatchesSelectedTruck(const char *topic, const char *suffix) {
  if (!topic || !suffix) {
    return false;
  }

  const String topicText(topic);
  const String truckNeedle = String("/truck/") + TRUCK_ID + "/";
  return topicText.startsWith("tenant/") &&
         topicText.indexOf(truckNeedle) >= 0 &&
         topicText.endsWith(suffix);
}

bool parseBssidString(const char *raw, uint8_t out[6]) {
  if (!raw || strlen(raw) != 17) {
    return false;
  }

  unsigned int bytes[6] = {};
  if (sscanf(raw, "%02x:%02x:%02x:%02x:%02x:%02x",
             &bytes[0], &bytes[1], &bytes[2], &bytes[3], &bytes[4], &bytes[5]) != 6) {
    return false;
  }

  for (int i = 0; i < 6; ++i) {
    if (bytes[i] > 0xFF) {
      return false;
    }
    out[i] = (uint8_t)bytes[i];
  }

  return true;
}

const char *wifiReasonName(uint8_t reason) {
  switch (reason) {
    case 0: return "none";
    case 2: return "auth expired";
    case 4: return "assoc expired";
    case 15: return "4-way handshake timeout";
    case 17: return "IE invalid";
    case 18: return "group cipher invalid";
    case 19: return "pairwise cipher invalid";
    case 20: return "AKMP invalid";
    case 21: return "unsupported RSN IE version";
    case 23: return "802.1x auth failed";
    case 24: return "cipher suite rejected";
    case 201: return "no AP found";
    case 202: return "auth fail";
    case 203: return "assoc fail";
    case 204: return "handshake timeout";
    case 205: return "connection fail";
    default: return "unknown";
  }
}

String topicBaseFromSuffix(const char *topic, const char *suffix) {
  const String topicText(topic ? topic : "");
  const String suffixText(suffix ? suffix : "");
  if (!topicText.endsWith(suffixText)) {
    return topicText;
  }

  return topicText.substring(0, topicText.length() - suffixText.length());
}

void beginGpsUart(uint32_t baud, int rxPin, int txPin) {
  SerialGPS.end();
  SerialGPS.begin(baud, SERIAL_8N1, rxPin, txPin);
  gpsActiveBaud = baud;
  gpsActiveRxPin = rxPin;
  gpsActiveTxPin = txPin;
  gpsLastBaudScanMs = millis();
  Serial.printf("[GPS] UART configured rx=%d tx=%d baud=%lu\n",
                gpsActiveRxPin,
                gpsActiveTxPin,
                (unsigned long)baud);
}

struct OtaChunkPacket {
  uint32_t magic;
  uint32_t totalSize;
  uint32_t offset;
  uint16_t chunkLen;
  uint8_t data[OTA_CHUNK_SIZE];
};

struct OtaBeginPacket {
  uint32_t magic;
  uint32_t totalSize;
  char filename[64];
};

struct OtaEndPacket {
  uint32_t magic;
  uint32_t totalSize;
  uint32_t crc32;
};

struct EspNowChannelPacket {
  uint32_t magic;
  uint8_t channel;
};

struct ParsedHttpUrl {
  String host;
  uint16_t port;
  String path;
  bool https;
};

bool ensureNetworkAndGprs();
bool reconnectMqtt();
bool parseHttpUrl(const char *url, ParsedHttpUrl &parts);
bool openWifiHttpStream(WiFiClient &client, const char *url, ParsedHttpUrl &parts, int32_t &contentLength);
uint32_t resolveTimestamp(const CargoPacket &pkt, bool &usedGpsTime, bool *usedGsmTime = nullptr);
void maintainConnectivity(unsigned long nowMs);
void processWifiTasks(unsigned long nowMs);
void publishWifiStatus(const char *message = nullptr);
void publishWifiScanResult(int networkCount);
bool runBoundedWifiScanFallback(const char *reason);
int findScannedChannelForSsid(const String &ssid);
bool findScannedBssidForSsid(const String &ssid, uint8_t out[6], String &bssidText);
void setEspNowPeerChannel(uint8_t channel);
bool notifyContainerWifiChannel(uint8_t channel);
bool publishOtaStatus(const char *target, const char *state, const char *message, uint8_t progress = 0);
void finishOtaFailure(const char *target, const char *message, bool abortUpdate = false);
void finishOtaCancelled(const char *target);
void flushMqttFor(uint32_t durationMs);
void publishGatewayRunningStatus();

bool parseHttpUrl(const char *url, ParsedHttpUrl &parts) {
  String raw = String(url ? url : "");
  raw.trim();

  String remainder;
  parts = ParsedHttpUrl{};
  if (raw.startsWith("https://")) {
    parts.https = true;
    parts.port = 443;
    remainder = raw.substring(8);
  } else if (raw.startsWith("http://")) {
    parts.https = false;
    parts.port = 80;
    remainder = raw.substring(7);
  } else {
    Serial.printf("[OTA] Unsupported URL (expected http:// or https://): %s\n", raw.c_str());
    return false;
  }

  const int slashIndex = remainder.indexOf('/');
  String hostPort = slashIndex >= 0 ? remainder.substring(0, slashIndex) : remainder;

