Geemal2004/Enterprise-Cargo-Monitoring-System/firmware/gateway-node/cargo_gateway_esp32.ino
  parts.path = slashIndex >= 0 ? remainder.substring(slashIndex) : "/";

  const int colonIndex = hostPort.lastIndexOf(':');
  if (colonIndex >= 0) {
    parts.host = hostPort.substring(0, colonIndex);
    const long parsedPort = hostPort.substring(colonIndex + 1).toInt();
    if (parsedPort > 0 && parsedPort <= 65535) {
      parts.port = (uint16_t)parsedPort;
    }
  } else {
    parts.host = hostPort;
  }

  if (parts.host.length() == 0) {
    Serial.println("[OTA] Parsed OTA host is empty");
    return false;
  }

  return true;
}

bool openWifiHttpStream(WiFiClient &client, const char *url, ParsedHttpUrl &parts, int32_t &contentLength) {
  contentLength = -1;

  if (!parseHttpUrl(url, parts)) {
    return false;
  }

  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("[OTA] WiFi is not connected for HTTP download");
    return false;
  }

  client.stop();
  client.setTimeout(15000);

  Serial.printf("[OTA] Opening WiFi %s stream host=%s port=%u path=%s\n",
                parts.https ? "HTTPS" : "HTTP",
                parts.host.c_str(),
                parts.port,
                parts.path.c_str());

  if (!client.connect(parts.host.c_str(), parts.port)) {
    Serial.println("[OTA] HTTP TCP/TLS connect failed over WiFi");
    return false;
  }

  client.printf(
    "GET %s HTTP/1.1\r\n"
    "Host: %s:%u\r\n"
    "Connection: close\r\n"
    "User-Agent: smart-cargo-gateway-ota\r\n"
    "\r\n",
    parts.path.c_str(),
    parts.host.c_str(),
    parts.port
  );

  String statusLine = client.readStringUntil('\n');
  statusLine.trim();
  if (statusLine.length() == 0) {
    Serial.println("[OTA] Empty HTTP status line");
    client.stop();
    return false;
  }

  Serial.printf("[OTA] HTTP status: %s\n", statusLine.c_str());
  const int firstSpace = statusLine.indexOf(' ');
  const int secondSpace = firstSpace >= 0 ? statusLine.indexOf(' ', firstSpace + 1) : -1;
  const int statusCode =
      (firstSpace >= 0 && secondSpace > firstSpace)
          ? statusLine.substring(firstSpace + 1, secondSpace).toInt()
          : 0;

  if (statusCode != 200) {
    Serial.printf("[OTA] Unexpected HTTP status code: %d\n", statusCode);
    client.stop();
    return false;
  }

  while (client.connected()) {
    String headerLine = client.readStringUntil('\n');
    if (headerLine == "\r" || headerLine.length() == 0) {
      break;
    }

    headerLine.trim();
    if (headerLine.startsWith("Content-Length:")) {
      contentLength = headerLine.substring(strlen("Content-Length:")).toInt();
    }
  }

  if (contentLength <= 0) {
    Serial.printf("[OTA] Invalid Content-Length: %ld\n", (long)contentLength);
    client.stop();
    return false;
  }

  return true;
}

void finishOtaFailure(const char *target, const char *message, bool abortUpdate) {
  Serial.printf("[OTA] %s failure: %s\n", target, message);

  if (abortUpdate) {
    Update.abort();
  }

  publishOtaStatus(target, "error", message, 0);
  otaPending = false;
  otaCancelRequested = false;
}

void finishOtaCancelled(const char *target) {
  Serial.printf("[OTA] %s cancelled\n", target);
  Update.abort();
  publishOtaStatus(target, "cancelled", "Update cancelled", 0);
  otaPending = false;
  otaCancelRequested = false;
}

const char *firmwareBuildLabel() {
  static const char prefix[] = "FW_BUILD:";
  if (strncmp(FIRMWARE_BUILD, prefix, strlen(prefix)) == 0) {
    return FIRMWARE_BUILD + strlen(prefix);
  }

  return FIRMWARE_BUILD;
}

bool publishOtaStatus(const char *target, const char *state, const char *message, uint8_t progress) {
  StaticJsonDocument<512> doc;
  doc["state"] = state;
  doc["message"] = message;
  doc["progress"] = progress;
  doc["target"] = target;
  doc["tenantId"] = TENANT_ID;
  doc["truckId"] = TRUCK_ID;
  doc["containerId"] = CONTAINER_ID;
  doc["firmwareBuild"] = firmwareBuildLabel();
  if (otaFilename[0] != '\0') {
    doc["filename"] = otaFilename;
  }

  char payload[512] = {};
  const size_t len = serializeJson(doc, payload, sizeof(payload));
  const String topic = strcmp(target, "container") == 0
                         ? otaContainerTopicBase + "/status"
                         : otaGatewayTopicBase + "/status";
  const bool ok = mqtt_client.connected() && mqtt_client.publish(topic.c_str(), payload, len);
  Serial.printf("[OTA] %s -> %s (%u%%) mqtt=%u\n", target, state, progress, ok ? 1 : 0);
  return ok;
}

void flushMqttFor(uint32_t durationMs) {
  const unsigned long startedMs = millis();
  while (millis() - startedMs < durationMs) {
    mqtt_client.loop();
    delay(50);
  }
}

void publishGatewayRunningStatus() {
  if (!mqtt_client.connected()) {
    return;
  }

  if (otaPending) {
    return;
  }

  publishOtaStatus("gateway", "success", "Gateway firmware is running", 100);
}

void publishWifiStatus(const char *message) {
  StaticJsonDocument<384> doc;
  doc["state"] = wifiStateName(wifiState);
  if (activeWifiSsid.length() > 0) {
    doc["ssid"] = activeWifiSsid;
  } else if (pendingWifiSsid.length() > 0) {
    doc["ssid"] = pendingWifiSsid;
  }
  if (WiFi.status() == WL_CONNECTED) {
    doc["ip"] = WiFi.localIP().toString();
    doc["rssi"] = WiFi.RSSI();
    doc["channel"] = WiFi.channel();
  } else {
    doc["wifiStatusCode"] = (int)WiFi.status();
    if (lastWifiDisconnectReason != 0) {
      doc["disconnectReason"] = lastWifiDisconnectReason;
      doc["disconnectReasonText"] = wifiReasonName(lastWifiDisconnectReason);
    }
  }
  if (message && message[0] != '\0') {
    doc["message"] = message;
  }

  char payload[384] = {};
  const size_t len = serializeJson(doc, payload, sizeof(payload));
  if (!mqtt_client.connected()) {
    wifiStatusDirty = true;
    return;
  }

  const String topic = wifiTopicBase + "/status";
  mqtt_client.publish(topic.c_str(), payload, len);
  wifiStatusDirty = false;
  Serial.printf("[WIFI] Status -> %s\n", payload);
}

void setEspNowPeerChannel(uint8_t channel) {
  if (channel == 0 || channel > 13) {
    return;
  }

  esp_now_peer_info_t peerInfo = {};
  memcpy(peerInfo.peer_addr, SENSOR_MAC_BYTES, 6);
  peerInfo.channel = channel;
  peerInfo.encrypt = false;

  // WiFi.begin() moves the radio to the router channel. ESP-NOW traffic only
  // works when both boards share that channel, so telemetry may pause during OTA
  // unless the container is also using this router channel.
  esp_err_t err = esp_now_is_peer_exist(SENSOR_MAC_BYTES)
                    ? esp_now_mod_peer(&peerInfo)
                    : esp_now_add_peer(&peerInfo);
  Serial.printf("[ESP-NOW] Peer channel set to %d err=%d\n", channel, (int)err);
}

void updateEspNowPeerChannel() {
  const int channel = WiFi.channel();
  if (channel <= 0) {
    return;
  }

