Geemal2004/Enterprise-Cargo-Monitoring-System/firmware/gateway-node/cargo_gateway_esp32.ino
  expectedContainerChannel = (uint8_t)channel;
  setEspNowPeerChannel((uint8_t)channel);
}

int findScannedChannelForSsid(const String &ssid) {
  for (size_t i = 0; i < scannedNetworkCacheCount; ++i) {
    if (scannedSsidCache[i] == ssid && scannedChannelCache[i] > 0) {
      return scannedChannelCache[i];
    }
  }

  return 0;
}

bool findScannedBssidForSsid(const String &ssid, uint8_t out[6], String &bssidText) {
  for (size_t i = 0; i < scannedNetworkCacheCount; ++i) {
    if (scannedSsidCache[i] == ssid && scannedBssidCache[i].length() == 17) {
      bssidText = scannedBssidCache[i];
      return parseBssidString(bssidText.c_str(), out);
    }
  }

  bssidText = "";
  return false;
}

bool notifyContainerWifiChannel(uint8_t channel) {
  if (channel == 0 || channel > 13) {
    return false;
  }

  if (WiFi.status() != WL_CONNECTED) {
    esp_wifi_scan_stop();
    WiFi.scanDelete();
    esp_wifi_set_channel(expectedContainerChannel, WIFI_SECOND_CHAN_NONE);
    setEspNowPeerChannel(expectedContainerChannel);
    delay(30);
  }

  EspNowChannelPacket packet{};
  packet.magic = ESP_NOW_CHANNEL_MAGIC;
  packet.channel = channel;

  esp_err_t lastErr = ESP_FAIL;
  for (uint8_t attempt = 0; attempt < 3; ++attempt) {
    lastErr = esp_now_send(SENSOR_MAC_BYTES, reinterpret_cast<const uint8_t *>(&packet), sizeof(packet));
    delay(40);
  }

  Serial.printf("[ESP-NOW] Requested container switch to channel %u err=%d\n",
                (unsigned int)channel,
                (int)lastErr);
  expectedContainerChannel = channel;
  return lastErr == ESP_OK;
}

void persistWifiCredentialsIfChanged(const String &ssid, const String &pass) {
  if (!wifiPrefsReady) {
    return;
  }

  const String storedSsid = wifiPrefs.getString("ssid", "");
  const String storedPass = wifiPrefs.getString("pass", "");
  const uint8_t storedChannel = wifiPrefs.getUChar("chan", 0);
  const uint8_t currentChannel = WiFi.status() == WL_CONNECTED ? (uint8_t)WiFi.channel() : 0;

  if (storedSsid != ssid || storedPass != pass || (currentChannel > 0 && storedChannel != currentChannel)) {
    wifiPrefs.putString("ssid", ssid);
    wifiPrefs.putString("pass", pass);
    if (currentChannel > 0) {
      wifiPrefs.putUChar("chan", currentChannel);
    }
    Serial.println("[WIFI] Credentials saved to NVS");
  }
}

void beginWifiConnect(const String &ssid, const String &pass, bool fromStoredCredentials, uint8_t preferredChannel = 0, const char *preferredBssid = nullptr) {
  if (ssid.length() == 0) {
    wifiState = WIFI_FAILED;
    wifiStatusDirty = true;
    publishWifiStatus("SSID is required");
    return;
  }

  uint8_t parsedBssid[6] = {};
  const bool hasPreferredBssid = parseBssidString(preferredBssid, parsedBssid);

  if (WiFi.status() == WL_CONNECTED && WiFi.SSID() == ssid) {
    activeWifiSsid = ssid;
    wifiState = WIFI_CONNECTED;
    lastWifiDisconnectReason = 0;
    updateEspNowPeerChannel();
    persistWifiCredentialsIfChanged(activeWifiSsid, pass);
    publishWifiStatus("Already connected");
    return;
  }

  pendingWifiSsid = ssid;
  pendingWifiPass = pass;
  lastWifiDisconnectReason = 0;
  pendingWifiChannel = preferredChannel;
  pendingWifiHasBssid = hasPreferredBssid;
  if (pendingWifiHasBssid) {
    memcpy(pendingWifiBssid, parsedBssid, sizeof(pendingWifiBssid));
  } else {
    memset(pendingWifiBssid, 0, sizeof(pendingWifiBssid));
  }
  wifiConnectStartedMs = millis();
  wifiState = WIFI_CONNECTING;
  wifiStatusDirty = true;
  if (wifiScanActive) {
    esp_wifi_scan_stop();
    WiFi.scanDelete();
    wifiScanActive = false;
  }

  Serial.printf("[WIFI] Connecting to %s...\n", pendingWifiSsid.c_str());
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.setAutoReconnect(true);

  int targetChannel = pendingWifiChannel > 0 ? pendingWifiChannel : findScannedChannelForSsid(pendingWifiSsid);
  if (targetChannel <= 0 && fromStoredCredentials && wifiPrefsReady) {
    targetChannel = wifiPrefs.getUChar("chan", 0);
  }

  String cachedBssidText;
  if (!pendingWifiHasBssid && findScannedBssidForSsid(pendingWifiSsid, pendingWifiBssid, cachedBssidText)) {
    pendingWifiHasBssid = true;
  }

  if (targetChannel > 0) {
    notifyContainerWifiChannel((uint8_t)targetChannel);
  } else {
    Serial.println("[ESP-NOW] No scanned WiFi channel for selected SSID; scan before connect or set fixed channel.");
  }

  WiFi.disconnect(false, false);
  delay(250);

  if (targetChannel > 0 && pendingWifiHasBssid) {
    const char *bssidForLog =
        (preferredBssid && preferredBssid[0] != '\0') ? preferredBssid : cachedBssidText.c_str();
    Serial.printf("[WIFI] Connecting with channel=%d bssid=%s\n", targetChannel, bssidForLog);
    WiFi.begin(pendingWifiSsid.c_str(), pendingWifiPass.c_str(), targetChannel, pendingWifiBssid);
  } else if (targetChannel > 0) {
    Serial.printf("[WIFI] Connecting with channel=%d\n", targetChannel);
    WiFi.begin(pendingWifiSsid.c_str(), pendingWifiPass.c_str(), targetChannel);
  } else {
    WiFi.begin(pendingWifiSsid.c_str(), pendingWifiPass.c_str());
  }
  publishWifiStatus(fromStoredCredentials ? "Connecting with stored credentials" : "Connecting");
}

void attemptStoredWifiConnect() {
  if (!wifiPrefsReady) {
    return;
  }

  const String ssid = wifiPrefs.getString("ssid", "");
  const String pass = wifiPrefs.getString("pass", "");
  if (ssid.length() == 0) {
    Serial.println("[WIFI] No stored credentials");
    return;
  }

  beginWifiConnect(ssid, pass, true);
}

void startWifiScan() {
  if (wifiScanActive || wifiState == WIFI_SCANNING) {
    publishWifiStatus("Scan already running");
    return;
  }

  Serial.println("[WIFI] Scan requested");
  // Stop any background connection loops so the radio is freed up for scanning
  WiFi.disconnect();
  delay(100);
  esp_wifi_scan_stop();
  WiFi.scanDelete();
  const int result = WiFi.scanNetworks(true, true, false, WIFI_SCAN_MAX_MS_PER_CHANNEL);
  wifiScanActive = true;
  wifiScanStartedMs = millis();
  wifiState = WIFI_SCANNING;
  wifiStatusDirty = true;
  publishWifiStatus("Scan started");

  if (result >= 0) {
    Serial.printf("[WIFI] Async scan completed immediately count=%d\n", result);
    publishWifiScanResult(result);
    WiFi.scanDelete();
    wifiScanActive = false;
    wifiState = WiFi.status() == WL_CONNECTED ? WIFI_CONNECTED : WIFI_IDLE;
    publishWifiStatus("Scan complete");
  } else if (result != WIFI_SCAN_RUNNING) {
    Serial.printf("[WIFI] Async scan returned immediate code=%d\n", result);
  }
}

bool runBoundedWifiScanFallback(const char *reason) {
  Serial.printf("[WIFI] Running bounded fallback scan: %s\n", reason ? reason : "unknown");

