Geemal2004/Enterprise-Cargo-Monitoring-System/firmware/gateway-node/cargo_gateway_esp32.ino
  WiFi.disconnect();
  delay(100);
  esp_wifi_scan_stop();
  WiFi.scanDelete();
  delay(20);

  const int networkCount = WiFi.scanNetworks(false, true, false, WIFI_SCAN_MAX_MS_PER_CHANNEL);
  if (networkCount < 0) {
    Serial.printf("[WIFI] Fallback scan failed code=%d\n", networkCount);
    return false;
  }

  publishWifiScanResult(networkCount);
  WiFi.scanDelete();
  wifiState = WiFi.status() == WL_CONNECTED ? WIFI_CONNECTED : WIFI_IDLE;
  publishWifiStatus("Scan complete");
  return true;
}

void publishWifiScanResult(int networkCount) {
  StaticJsonDocument<512> doc;
  JsonArray networks = doc.to<JsonArray>();
  // Send fewer networks down the cellular link to avoid packet drops on 2G
  // ESP32 automatically sorts these by RSSI (strongest first)
  const int limitedCount = min(networkCount, 4);
  scannedNetworkCacheCount = 0;

  for (int i = 0; i < limitedCount; ++i) {
    const String ssid = WiFi.SSID(i);
    const int channel = WiFi.channel(i);
    const String bssid = WiFi.BSSIDstr(i);
    JsonObject item = networks.createNestedObject();
    item["ssid"] = ssid;
    item["bssid"] = bssid;
    item["rssi"] = WiFi.RSSI(i);
    item["secure"] = WiFi.encryptionType(i) != WIFI_AUTH_OPEN;
    item["channel"] = channel;

    if (ssid.length() > 0 && channel > 0) {
      scannedSsidCache[scannedNetworkCacheCount] = ssid;
      scannedChannelCache[scannedNetworkCacheCount] = (uint8_t)channel;
      scannedBssidCache[scannedNetworkCacheCount] = bssid;
      scannedNetworkCacheCount++;
    }
  }

  char payload[512] = {};
  const size_t len = serializeJson(doc, payload, sizeof(payload));
  if (mqtt_client.connected()) {
    const String topic = wifiTopicBase + "/scan/result";
    mqtt_client.publish(topic.c_str(), payload, len);
    Serial.printf("[WIFI] Scan result published count=%d sent=%d\n", networkCount, limitedCount);
  } else {
    Serial.println("[WIFI] MQTT disconnected before scan result publish");
  }
}

void processWifiScan(unsigned long nowMs) {
  nowMs = millis();

  if (!wifiScanActive) {
    return;
  }

  const int result = WiFi.scanComplete();
  if (result == WIFI_SCAN_RUNNING) {
    if (nowMs - wifiScanStartedMs > WIFI_SCAN_TIMEOUT_MS) {
      Serial.printf("[WIFI] Scan timeout after %lu ms\n", (unsigned long)(nowMs - wifiScanStartedMs));
      WiFi.scanDelete();
      wifiScanActive = false;
      if (!runBoundedWifiScanFallback("async scan timed out")) {
        wifiState = WiFi.status() == WL_CONNECTED ? WIFI_CONNECTED : WIFI_IDLE;
        publishWifiStatus("Scan timed out; WiFi radio returned no scan result");
      }
    }
    return;
  }

  if (result == WIFI_SCAN_FAILED) {
    Serial.println("[WIFI] Scan failed");
    WiFi.scanDelete();
    wifiScanActive = false;
    if (!runBoundedWifiScanFallback("async scan failed")) {
      wifiState = WiFi.status() == WL_CONNECTED ? WIFI_CONNECTED : WIFI_IDLE;
      publishWifiStatus("Scan failed; WiFi radio returned WIFI_SCAN_FAILED");
    }
    return;
  }

  publishWifiScanResult(result);
  WiFi.scanDelete();
  wifiScanActive = false;
  wifiState = WiFi.status() == WL_CONNECTED ? WIFI_CONNECTED : WIFI_IDLE;
  publishWifiStatus("Scan complete");
}

void processWifiConnect(unsigned long nowMs) {
  nowMs = millis();

  const bool isConnected = WiFi.status() == WL_CONNECTED;
  if (wifiGotIpEventPending || isConnected) {
    wifiGotIpEventPending = false;
    if (!isConnected) {
      return;
    }

    if (wifiState != WIFI_CONNECTED) {
      activeWifiSsid = pendingWifiSsid.length() > 0 ? pendingWifiSsid : WiFi.SSID();
      wifiState = WIFI_CONNECTED;
      lastWifiDisconnectReason = 0;
      updateEspNowPeerChannel();
      persistWifiCredentialsIfChanged(activeWifiSsid, pendingWifiPass);
      Serial.printf("[WIFI] Connected, IP=%s\n", WiFi.localIP().toString().c_str());
      publishWifiStatus("Connected");
    }
    return;
  }

  if (wifiState != WIFI_CONNECTING) {
    return;
  }

  if (nowMs - wifiConnectStartedMs >= WIFI_CONNECT_TIMEOUT_MS) {
    Serial.printf("[WIFI] Connect failed for %s\n", pendingWifiSsid.c_str());
    wifiState = WIFI_FAILED;
    activeWifiSsid = "";
    const int scannedChannel = findScannedChannelForSsid(pendingWifiSsid);
    if (scannedChannel > 0) {
      expectedContainerChannel = (uint8_t)scannedChannel;
      esp_wifi_set_channel((uint8_t)scannedChannel, WIFI_SECOND_CHAN_NONE);
      setEspNowPeerChannel((uint8_t)scannedChannel);
    }
    publishWifiStatus("Connection timed out");
  }
}

void processWifiTasks(unsigned long nowMs) {
  processWifiScan(nowMs);
  processWifiConnect(nowMs);

  if (wifiStatusDirty && mqtt_client.connected()) {
    publishWifiStatus();
  }
}

// -----------------------------------------------------------------------------
// OTA over WiFi
// -----------------------------------------------------------------------------

void performGatewayOta() {
  if (otaUrl[0] == '\0') {
    otaPending = false;
    return;
  }

  if (otaCancelRequested) {
    finishOtaCancelled("gateway");
    return;
  }

  if (WiFi.status() != WL_CONNECTED) {
    finishOtaFailure("gateway", "Gateway WiFi is not connected");
    return;
  }

  ParsedHttpUrl gatewayOtaParts{};
  if (!parseHttpUrl(otaUrl, gatewayOtaParts)) {
    finishOtaFailure("gateway", "Gateway OTA URL must use http:// or https:// firmware URL");
    return;
  }

  Serial.printf("[OTA] Download started: %s\n", otaUrl);
  publishOtaStatus("gateway", "downloading", "Download started over WiFi", 0);

  WiFiClient plainClient;
  WiFiClientSecure tlsClient;
  WiFiClient *downloadClient = &plainClient;
  if (gatewayOtaParts.https) {
    tlsClient.setInsecure();
    downloadClient = &tlsClient;
  }

  lastGatewayOtaProgress = 255;
  lastGatewayOtaProgressMs = 0;
  activeGatewayOtaClient = downloadClient;

  httpUpdate.rebootOnUpdate(false);
  httpUpdate.onProgress([](int current, int total) {
    if (total <= 0) {
      return;
    }

    const uint8_t progress = (uint8_t)(((uint64_t)current * 100) / (uint32_t)total);
    const unsigned long nowMs = millis();
    if (progress == lastGatewayOtaProgress && (nowMs - lastGatewayOtaProgressMs) < 2000UL) {
      return;
    }

    if (progress == 100 || lastGatewayOtaProgress == 255 || progress >= lastGatewayOtaProgress + 5) {
      lastGatewayOtaProgress = progress;
      lastGatewayOtaProgressMs = nowMs;
      publishOtaStatus("gateway", "downloading", "Downloading firmware over WiFi", progress);
      mqtt_client.loop();
    }

    if (otaCancelRequested) {
      if (activeGatewayOtaClient) {
        activeGatewayOtaClient->stop();
      }
    }
  });

  const t_httpUpdate_return result = httpUpdate.update(*downloadClient, otaUrl);
  activeGatewayOtaClient = nullptr;
  downloadClient->stop();

  switch (result) {
    case HTTP_UPDATE_OK:
      if (otaCancelRequested) {
        finishOtaCancelled("gateway");
        break;
      }
      publishOtaStatus("gateway", "success", "Update successful, rebooting", 100);
      Serial.println("[OTA] Update successful, rebooting");
      flushMqttFor(OTA_SUCCESS_MQTT_FLUSH_MS);
      delay(500);
      ESP.restart();
      break;
    case HTTP_UPDATE_NO_UPDATES:
      finishOtaFailure("gateway", "No update was available");
      break;
    case HTTP_UPDATE_FAILED: {
      if (otaCancelRequested) {
        finishOtaCancelled("gateway");
        break;
      }
      String error = httpUpdate.getLastErrorString();
      if (error.length() == 0) {
        error = "HTTPUpdate failed";
      }
      finishOtaFailure("gateway", error.c_str());
      break;
    }
  }
}

