Geemal2004/Enterprise-Cargo-Monitoring-System/firmware/gateway-node/cargo_gateway_esp32.ino
void performContainerOta() {
  if (otaUrl[0] == '\0') {
    otaPending = false;
    return;
  }

  if (otaCancelRequested) {
    finishOtaCancelled("container");
    return;
  }

  if (WiFi.status() != WL_CONNECTED) {
    finishOtaFailure("container", "Gateway WiFi is not connected");
    return;
  }

  Serial.printf("[OTA] Downloading container firmware from %s\n", otaUrl);
  publishOtaStatus("container", "downloading", "Preparing WiFi container download", 0);

  ParsedHttpUrl parts{};
  if (!parseHttpUrl(otaUrl, parts)) {
    finishOtaFailure("container", "Container OTA URL must use http:// or https:// firmware URL");
    return;
  }

  WiFiClient plainClient;
  WiFiClientSecure tlsClient;
  WiFiClient *downloadClient = &plainClient;
  if (parts.https) {
    tlsClient.setInsecure();
    downloadClient = &tlsClient;
  }

  int32_t totalSize = -1;
  if (!openWifiHttpStream(*downloadClient, otaUrl, parts, totalSize)) {
    finishOtaFailure("container", "Could not download container firmware over WiFi");
    return;
  }

  OtaBeginPacket beginPacket{};
  beginPacket.magic = OTA_PKT_BEGIN;
  beginPacket.totalSize = (uint32_t)totalSize;
  strncpy(beginPacket.filename, otaFilename, sizeof(beginPacket.filename) - 1);
  esp_now_send(SENSOR_MAC_BYTES, reinterpret_cast<const uint8_t *>(&beginPacket), sizeof(beginPacket));
  delay(50);

  uint8_t chunkBuffer[OTA_CHUNK_SIZE] = {};
  uint32_t offset = 0;
  uint32_t bytesLeft = (uint32_t)totalSize;
  uint8_t lastProgress = 255;
  unsigned long lastDataMs = millis();

  while (bytesLeft > 0 && (downloadClient->connected() || downloadClient->available())) {
    if (otaCancelRequested) {
      downloadClient->stop();
      finishOtaCancelled("container");
      return;
    }

    const int availableBytes = downloadClient->available();
    if (availableBytes <= 0) {
      if (millis() - lastDataMs > OTA_READ_TIMEOUT_MS) {
        downloadClient->stop();
        finishOtaFailure("container", "Timed out while downloading container firmware");
        return;
      }
      mqtt_client.loop();
      if (otaCancelRequested) {
        downloadClient->stop();
        finishOtaCancelled("container");
        return;
      }
      maintainConnectivity(millis());
      delay(10);
      continue;
    }

    const size_t toRead = min((size_t)OTA_CHUNK_SIZE, min((size_t)availableBytes, (size_t)bytesLeft));
    const int got = downloadClient->read(chunkBuffer, toRead);
    if (got <= 0) {
      delay(10);
      continue;
    }

    lastDataMs = millis();

    OtaChunkPacket chunk{};
    chunk.magic = OTA_PKT_CHUNK;
    chunk.totalSize = (uint32_t)totalSize;
    chunk.offset = offset;
    chunk.chunkLen = (uint16_t)got;
    memcpy(chunk.data, chunkBuffer, (size_t)got);

    esp_now_send(SENSOR_MAC_BYTES, reinterpret_cast<const uint8_t *>(&chunk), sizeof(chunk));

    offset += (uint32_t)got;
    bytesLeft -= (uint32_t)got;

    const uint8_t progress = (uint8_t)(((uint64_t)offset * 100) / (uint32_t)totalSize);
    if (progress == 100 || lastProgress == 255 || progress >= lastProgress + 5) {
      lastProgress = progress;
      publishOtaStatus("container", "flashing", "Relaying firmware to container", progress);
    }

    mqtt_client.loop();
    if (otaCancelRequested) {
      downloadClient->stop();
      finishOtaCancelled("container");
      return;
    }
    maintainConnectivity(millis());
    delay(20);
  }

  downloadClient->stop();

  if (offset != (uint32_t)totalSize) {
    finishOtaFailure("container", "Container firmware size mismatch");
    return;
  }

  OtaEndPacket endPacket{};
  endPacket.magic = OTA_PKT_END;
  endPacket.totalSize = (uint32_t)totalSize;
  esp_now_send(SENSOR_MAC_BYTES, reinterpret_cast<const uint8_t *>(&endPacket), sizeof(endPacket));

  publishOtaStatus("container", "success", "Firmware sent, container flashing", 100);
  otaPending = false;
}

void queueOtaCommand(JsonDocument &doc, const char *topic) {
  const char *cmd = doc["cmd"] | "";
  const char *target = doc["target"] | (strcmp(topic, OTA_CONTAINER_CMD_TOPIC) == 0 ? "container" : "gateway");

  if (strcmp(cmd, "ota_cancel") == 0) {
    const bool targetIsContainer = strcmp(target, "container") == 0;
    const bool matchesActiveTarget = otaPending && (otaIsForContainer == targetIsContainer);
    if (matchesActiveTarget) {
      otaCancelRequested = true;
      Serial.printf("[OTA] Cancel requested for %s\n", target);
    } else {
      publishOtaStatus(target, "cancelled", "No active update to cancel", 0);
    }
    return;
  }

  if (strcmp(cmd, "ota_update") != 0) {
    return;
  }

  const char *url = doc["url"] | "";
  const char *filename = doc["filename"] | "firmware";
  if (url[0] == '\0') {
    Serial.println("[OTA] Missing url in command");
    publishOtaStatus(target, "error", "Missing firmware URL", 0);
    return;
  }

  if (WiFi.status() != WL_CONNECTED) {
    publishOtaStatus(target, "error", "Gateway WiFi is not connected", 0);
    return;
  }

  memset(otaUrl, 0, sizeof(otaUrl));
  memset(otaFilename, 0, sizeof(otaFilename));
  strncpy(otaUrl, url, sizeof(otaUrl) - 1);
  strncpy(otaFilename, filename, sizeof(otaFilename) - 1);
  otaExpectedSize = doc["size"] | 0;
  otaIsForContainer = strcmp(target, "container") == 0;
  otaCancelRequested = false;
  if (otaIsForContainer) {
    otaContainerTopicBase = topicBaseFromSuffix(topic, "/command");
  } else {
    otaGatewayTopicBase = topicBaseFromSuffix(topic, "/command");
  }
  otaPending = true;

  Serial.printf("[OTA] Queued: target=%s url=%s\n", target, otaUrl);
  publishOtaStatus(target, "pending", "Command received, starting update", 0);
}

void onMqttMessage(char *topic, byte *payload, unsigned int length) {
  if (topic == nullptr) {
    return;
  }

  if (strcmp(topic, WIFI_SCAN_REQUEST_TOPIC) == 0 ||
      topicMatchesSelectedTruck(topic, "/gateway/wifi/scan/request")) {
    wifiTopicBase = topicBaseFromSuffix(topic, "/scan/request");
    startWifiScan();
    return;
  }

  if (payload == nullptr || length == 0) {
    return;
  }

  if (strcmp(topic, WIFI_CONNECT_TOPIC) == 0 ||
      topicMatchesSelectedTruck(topic, "/gateway/wifi/connect")) {
    wifiTopicBase = topicBaseFromSuffix(topic, "/connect");
    StaticJsonDocument<256> doc;
    if (deserializeJson(doc, payload, length) != DeserializationError::Ok) {
      Serial.println("[WIFI] Invalid JSON connect payload");
      wifiState = WIFI_FAILED;
      publishWifiStatus("Invalid JSON connect payload");
      return;
    }

