Geemal2004/Enterprise-Cargo-Monitoring-System/firmware/gateway-node/cargo_gateway_esp32.ino
    const char *ssid = doc["ssid"] | "";
    const char *password = doc["password"] | "";
    const uint8_t channel = doc["channel"] | 0;
    const char *bssid = doc["bssid"] | "";
    beginWifiConnect(String(ssid), String(password), false, channel, bssid);
    return;
  }

  const bool isGatewayOtaTopic =
      strcmp(topic, OTA_COMMAND_TOPIC) == 0 ||
      topicMatchesSelectedTruck(topic, "/ota/gateway/command");
  const bool isContainerOtaTopic =
      strcmp(topic, OTA_CONTAINER_CMD_TOPIC) == 0 ||
      topicMatchesSelectedTruck(topic, "/ota/container/command");

  if (!isGatewayOtaTopic && !isContainerOtaTopic) {
    return;
  }

  StaticJsonDocument<384> doc;
  if (deserializeJson(doc, payload, length) != DeserializationError::Ok) {
    Serial.println("[OTA] Invalid JSON command");
    return;
  }

  queueOtaCommand(doc, topic);
}

void processPendingOta() {
  if (!otaPending) {
    return;
  }

  if (otaCancelRequested) {
    finishOtaCancelled(otaIsForContainer ? "container" : "gateway");
    return;
  }

  if (otaIsForContainer) {
    performContainerOta();
  } else {
    performGatewayOta();
  }
}

void gpsPump() {
  while (SerialGPS.available() > 0) {
    gps.encode(SerialGPS.read());
    gpsRawByteCount++;
    gpsLastByteMs = millis();
  }
}

void gpsMaybeScanBaud(unsigned long nowMs) {
  if (gps.location.isValid()) return;
  if (nowMs - gpsLastBaudScanMs < GPS_BAUD_SCAN_INTERVAL_MS) return;

  const bool hasRecentGpsBytes =
      (gpsRawByteCount > 0) && ((nowMs - gpsLastByteMs) <= GPS_STREAM_STALE_MS);
  const bool hasParsedNmea = (gps.passedChecksum() > 0) || (gps.failedChecksum() > 0);
  const bool warmupElapsed = (nowMs - bootMs) >= GPS_WARMUP_MS;

  if (hasParsedNmea || (hasRecentGpsBytes && !warmupElapsed)) {
    gpsLastBaudScanMs = nowMs;
    return;
  }

  gpsBaudCandidateIndex =
      (gpsBaudCandidateIndex + 1) % (sizeof(GPS_BAUD_CANDIDATES) / sizeof(GPS_BAUD_CANDIDATES[0]));
  if (gpsBaudCandidateIndex == 0) {
    gpsPinCandidateIndex =
        (gpsPinCandidateIndex + 1) % (sizeof(GPS_UART_PIN_CANDIDATES) / sizeof(GPS_UART_PIN_CANDIDATES[0]));
  }

  const uint32_t nextBaud = GPS_BAUD_CANDIDATES[gpsBaudCandidateIndex];
  const int nextRxPin = GPS_UART_PIN_CANDIDATES[gpsPinCandidateIndex][0];
  const int nextTxPin = GPS_UART_PIN_CANDIDATES[gpsPinCandidateIndex][1];
  beginGpsUart(nextBaud, nextRxPin, nextTxPin);
}

int64_t daysFromCivil(int y, unsigned m, unsigned d) {
  y -= m <= 2;
  const int era = (y >= 0 ? y : y - 399) / 400;
  const unsigned yoe = static_cast<unsigned>(y - era * 400);
  const unsigned doy = (153 * (m + (m > 2 ? -3 : 9)) + 2) / 5 + d - 1;
  const unsigned doe = yoe * 365 + yoe / 4 - yoe / 100 + doy;
  return era * 146097 + static_cast<int>(doe) - 719468;
}

uint32_t resolveTimestamp(const CargoPacket &pkt, bool &usedGpsTime, bool *usedGsmTime) {
  usedGpsTime = false;
  if (usedGsmTime) {
    *usedGsmTime = false;
  }

  if (gps.date.isValid() && gps.time.isValid()) {
    const int year = gps.date.year();
    const unsigned month = gps.date.month();
    const unsigned day = gps.date.day();
    const int64_t days = daysFromCivil(year, month, day);
    const int64_t ts = days * 86400LL +
                       (int64_t)gps.time.hour() * 3600LL +
                       (int64_t)gps.time.minute() * 60LL +
                       (int64_t)gps.time.second();
    if (ts >= (int64_t)MIN_VALID_UNIX_TS && ts <= 0xFFFFFFFFLL) {
      usedGpsTime = true;
      return (uint32_t)ts;
    }
  }

  int year = 0;
  int month = 0;
  int day = 0;
  int hour = 0;
  int minute = 0;
  int second = 0;
  float tz = 0.0f;
  if (modem.getNetworkTime(&year, &month, &day, &hour, &minute, &second, &tz)) {
    if (year >= 2024) {
      const int64_t days = daysFromCivil(year, (unsigned)month, (unsigned)day);
      const int64_t ts = days * 86400LL +
                         (int64_t)hour * 3600LL +
                         (int64_t)minute * 60LL +
                         (int64_t)second;
      const int64_t utcTs = ts - (int64_t)(tz * 3600.0f);
      if (utcTs >= (int64_t)MIN_VALID_UNIX_TS && utcTs <= 0xFFFFFFFFLL) {
        if (usedGsmTime) {
          *usedGsmTime = true;
        }
        return (uint32_t)utcTs;
      }
    }
  }

  return pkt.ts;
}

void readGpsSnapshot(float &lat, float &lon, float &speedKph, bool &gpsFix) {
  gpsPump();
  gpsFix = gps.location.isValid();

  if (gpsFix) {
    lat = (float)gps.location.lat();
    lon = (float)gps.location.lng();
    speedKph = gps.speed.isValid() ? (float)gps.speed.kmph() : 0.0f;
  } else {
    lat = 0.0f;
    lon = 0.0f;
    speedKph = 0.0f;
  }
}

// -----------------------------------------------------------------------------
// ESP-NOW receive
// -----------------------------------------------------------------------------

void handleEspNowData(const uint8_t *senderMac, const uint8_t *data, int len) {
  if (!senderMac || !data) return;

  if (!macEquals(senderMac, SENSOR_MAC_BYTES)) {
    rejectedMacCount++;
    return;
  }
  if (len != (int)sizeof(CargoPacket)) {
    rejectedLengthCount++;
    return;
  }

  portENTER_CRITICAL_ISR(&packetMux);
  memcpy(&rxPacket, data, sizeof(CargoPacket));
  packetReady = true;
  portEXIT_CRITICAL_ISR(&packetMux);
}

#if (defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)) || \
    (defined(ESP_IDF_VERSION_MAJOR) && (ESP_IDF_VERSION_MAJOR >= 5))
void onEspNowSent(const wifi_tx_info_t *txInfo, esp_now_send_status_t status) {
  (void)txInfo;
  Serial.printf("[ESP-NOW] Send => %s\n",
                status == ESP_NOW_SEND_SUCCESS ? "SUCCESS" : "FAILED");
}

void onEspNowReceive(const esp_now_recv_info_t *recvInfo, const uint8_t *data, int len) {
  if (!recvInfo) return;
  handleEspNowData(recvInfo->src_addr, data, len);
}
#else
void onEspNowSent(const uint8_t *senderMac, esp_now_send_status_t status) {
  Serial.printf("[ESP-NOW] Send to %s => %s\n",
                senderMac ? macToString(senderMac).c_str() : "unknown",
                status == ESP_NOW_SEND_SUCCESS ? "SUCCESS" : "FAILED");
}

void onEspNowReceive(const uint8_t *senderMac, const uint8_t *data, int len) {
  handleEspNowData(senderMac, data, len);
}
#endif

void onWifiEvent(WiFiEvent_t event, WiFiEventInfo_t info) {
  switch (event) {
    case ARDUINO_EVENT_WIFI_STA_START:
      Serial.println("[WIFI] STA started");
      break;
    case ARDUINO_EVENT_WIFI_STA_CONNECTED:
      Serial.printf("[WIFI] Associated to AP, channel=%u\n", (unsigned int)WiFi.channel());
      break;
    case ARDUINO_EVENT_WIFI_STA_GOT_IP:
      wifiGotIpEventPending = true;
      Serial.printf("[WIFI] Got IP=%s\n", WiFi.localIP().toString().c_str());
      break;
    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
      lastWifiDisconnectReason = info.wifi_sta_disconnected.reason;
      Serial.printf("[WIFI] Disconnected reason=%u (%s)\n",
                    (unsigned int)lastWifiDisconnectReason,
                    wifiReasonName(lastWifiDisconnectReason));
      break;
    default:
      break;
  }
}

