Geemal2004/Enterprise-Cargo-Monitoring-System/firmware/gateway-node/cargo_gateway_esp32.ino
bool consumePacket(CargoPacket &pkt) {
  bool hasPacket = false;
  portENTER_CRITICAL(&packetMux);
  if (packetReady) {
    pkt = rxPacket;
    packetReady = false;
    hasPacket = true;
  }
  portEXIT_CRITICAL(&packetMux);
  return hasPacket;
}

void initEspNow() {
  WiFi.mode(WIFI_STA);
  WiFi.disconnect();
  WiFi.setSleep(false);
  esp_wifi_set_channel(ESP_NOW_BOOT_CHANNEL, WIFI_SECOND_CHAN_NONE);

  String localMac = WiFi.macAddress();
  localMac.toUpperCase();
  Serial.printf("[ESP-NOW] Local MAC=%s\n", localMac.c_str());
  Serial.printf("[ESP-NOW] Expect sender MAC=%s\n", SENSOR_MAC_STR);
  Serial.printf("[ESP-NOW] Gateway MAC target=%s\n", GATEWAY_MAC_STR);

  if (esp_now_init() != ESP_OK) {
    Serial.println("[ESP-NOW] Init failed");
    return;
  }

  esp_now_register_send_cb(onEspNowSent);
  esp_now_register_recv_cb(onEspNowReceive);

  if (!esp_now_is_peer_exist(SENSOR_MAC_BYTES)) {
    esp_now_peer_info_t peerInfo = {};
    memcpy(peerInfo.peer_addr, SENSOR_MAC_BYTES, 6);
    peerInfo.channel = ESP_NOW_BOOT_CHANNEL;
    peerInfo.encrypt = false;
    if (esp_now_add_peer(&peerInfo) != ESP_OK) {
      Serial.println("[ESP-NOW] Failed to add container peer");
    }
  }

  Serial.println("[ESP-NOW] RX/TX callbacks ready");
}

void broadcastTimeSync(unsigned long nowMs) {
  if (nowMs - lastTimeSyncMs < TIME_SYNC_INTERVAL_MS) {
    return;
  }

  bool usedGpsTime = false;
  bool usedGsmTime = false;
  CargoPacket dummy{};
  uint32_t ts = resolveTimestamp(dummy, usedGpsTime, &usedGsmTime);
  if (ts < MIN_VALID_UNIX_TS) {
    return;
  }

  lastTimeSyncMs = nowMs;

  TimeSyncPacket sync{};
  sync.magic = TIME_SYNC_MAGIC;
  sync.unixTs = ts;

  esp_err_t err = esp_now_send(
    SENSOR_MAC_BYTES,
    reinterpret_cast<const uint8_t *>(&sync),
    sizeof(sync)
  );

  Serial.printf("[TIMESYNC] ts=%lu gps=%u gsm=%u err=%d\n",
                (unsigned long)ts,
                usedGpsTime ? 1 : 0,
                usedGsmTime ? 1 : 0,
                (int)err);
}

// -----------------------------------------------------------------------------
// Connectivity and reconnect
// -----------------------------------------------------------------------------

bool ensureModemReady() {
  if (modem.testAT()) return true;

  Serial.println("[GSM] testAT failed, restarting modem...");
  modem.restart();

  if (!modem.testAT()) {
    Serial.println("[GSM] Modem not responding after restart");
    return false;
  }

  Serial.println("[GSM] Modem AT OK");
  return true;
}

bool ensureNetworkAndGprs() {
  if (!ensureModemReady()) return false;

  if (!modem.isNetworkConnected()) {
    Serial.println("[GSM] Waiting for network registration...");
    if (!modem.waitForNetwork(60000L, true)) {
      Serial.println("[GSM] Network registration failed");
      return false;
    }
    Serial.println("[GSM] Network registered");
  }

  if (!modem.isGprsConnected()) {
    Serial.printf("[GPRS] Connecting APN=%s ...\n", APN);
    if (!modem.gprsConnect(APN, APN_USER, APN_PASS)) {
      Serial.println("[GPRS] Connect failed");
      return false;
    }
    Serial.println("[GPRS] Connected");

    // Re-enable NITZ time sync on fresh PDP attachment so getNetworkTime() can resolve UTC.
    modem.sendAT("+CLTS=1");
    if (modem.waitResponse(2000) != 1) {
      Serial.println("[GSM] WARN: AT+CLTS=1 failed");
    }
    modem.sendAT("&W");
    if (modem.waitResponse(2000) != 1) {
      Serial.println("[GSM] WARN: AT&W failed after CLTS");
    } else {
      Serial.println("[GSM] Network time sync (CLTS) enabled");
    }
  }

  return true;
}

bool reconnectMqtt() {
  // Required cleanup before reconnect
  secure_client.stop();
  raw_tcp_transport.stop();
  secure_client.clearWriteError();
  raw_tcp_transport.clearWriteError();
  
  // Expand timeouts for the intensive TLS handshake over a slow serial link
  secure_client.setTimeout(35000);
  raw_tcp_transport.setTimeout(35000);
  
  Serial.println("[MQTT] Socket cleanup done");

  if (!ensureNetworkAndGprs()) return false;

  Serial.printf("[TLS] Direct SIM800L transport host=%s:%u\n",
                MQTT_BROKER_HOST, MQTT_BROKER_PORT);

  mqtt_client.setServer(MQTT_BROKER_HOST, MQTT_BROKER_PORT);
  if (!mqtt_client.setBufferSize(MQTT_BUFFER_BYTES)) {
    Serial.printf("[MQTT] WARN setBufferSize(%u) failed\n", (unsigned int)MQTT_BUFFER_BYTES);
  }
  mqtt_client.setKeepAlive(90);
  mqtt_client.setSocketTimeout(25);

  const uint64_t efuseMac = ESP.getEfuseMac();
  String clientId = String("gateway-") + TRUCK_ID + "-" + String((uint32_t)(efuseMac & 0xFFFFFFFF), HEX);
  clientId.toLowerCase();

  Serial.printf("[MQTT] Connecting clientId=%s user=%s\n", clientId.c_str(), MQTT_USERNAME);
  if (!mqtt_client.connect(clientId.c_str(), MQTT_USERNAME, MQTT_PASSWORD)) {
    Serial.printf("[MQTT] Connect failed rc=%d\n", mqtt_client.state());
    return false;
  }

  mqtt_client.subscribe(OTA_COMMAND_TOPIC, 1);
  mqtt_client.subscribe(OTA_CONTAINER_CMD_TOPIC, 1);
  mqtt_client.subscribe(WIFI_SCAN_REQUEST_TOPIC, 1);
  mqtt_client.subscribe(WIFI_CONNECT_TOPIC, 1);
  mqtt_client.subscribe(OTA_COMMAND_TOPIC_FILTER, 1);
  mqtt_client.subscribe(OTA_CONTAINER_CMD_TOPIC_FILTER, 1);
  mqtt_client.subscribe(WIFI_SCAN_REQUEST_TOPIC_FILTER, 1);
  mqtt_client.subscribe(WIFI_CONNECT_TOPIC_FILTER, 1);
  Serial.println("[MQTT] Subscribed to OTA command topics");
  Serial.println("[MQTT] Subscribed to WiFi management topics");

  Serial.println("[MQTT] Connected over TLS 1.2");
  publishWifiStatus();
  publishGatewayRunningStatus();
  return true;
}

void maintainConnectivity(unsigned long nowMs) {
  if (mqtt_client.connected()) return;
  if (nowMs - lastReconnectAttemptMs < RECONNECT_INTERVAL_MS) return;

  lastReconnectAttemptMs = nowMs;
  Serial.println("[NET] Reconnect attempt...");
  if (!reconnectMqtt()) {
    Serial.println("[NET] Reconnect failed");
  }
}

// -----------------------------------------------------------------------------
// Publish
// -----------------------------------------------------------------------------

bool publishTelemetry(const CargoPacket &pkt) {
  float lat = 0.0f;
  float lon = 0.0f;
  float speedKph = 0.0f;
  bool gpsFix = false;
  bool usedGpsTime = false;

  readGpsSnapshot(lat, lon, speedKph, gpsFix);
  uint32_t ts = resolveTimestamp(pkt, usedGpsTime);

  StaticJsonDocument<768> doc;
  doc["tenantId"] = TENANT_ID;
  doc["fleetId"] = FLEET_ID;
  doc["truckId"] = TRUCK_ID;
  doc["containerId"] = CONTAINER_ID;
  doc["gatewayMac"] = GATEWAY_MAC_STR;
  doc["sensorNodeMac"] = SENSOR_MAC_STR;
  doc["seq"] = pkt.seq;
  doc["ts"] = ts;

  JsonObject gpsObj = doc.createNestedObject("gps");
  gpsObj["lat"] = lat;
  gpsObj["lon"] = lon;
  gpsObj["speedKph"] = speedKph;

