Geemal2004/Enterprise-Cargo-Monitoring-System/firmware/gateway-node/cargo_gateway_esp32.ino
  JsonObject envObj = doc.createNestedObject("env");
  envObj["temperatureC"] = pkt.tempC;
  envObj["humidityPct"] = pkt.humidity;
  envObj["pressureHpa"] = pkt.pressure;

  JsonObject motionObj = doc.createNestedObject("motion");
  motionObj["tiltDeg"] = pkt.tilt;
  motionObj["shock"] = pkt.shock;

  JsonObject gasObj = doc.createNestedObject("gas");
  gasObj["mq2Raw"] = pkt.gasRaw;
  gasObj["smokePpm"] = pkt.gasPpm;
  gasObj["alert"] = pkt.gasPpm > SMOKE_ALERT_THRESHOLD_PPM;

  JsonObject statusObj = doc.createNestedObject("status");
  statusObj["sdOk"] = pkt.sdOk;
  statusObj["gpsFix"] = gpsFix;
  statusObj["uplink"] = "gsm";

  char payload[768];
  size_t payloadLen = serializeJson(doc, payload, sizeof(payload));

  const size_t topicLen = strlen(MQTT_TOPIC);
  const size_t estPacketLen = topicLen + payloadLen + 10;
  if (estPacketLen > MQTT_BUFFER_BYTES) {
    Serial.printf("[PUB] WARN packet too large: topic=%u payload=%u est=%u buffer=%u\n",
                  (unsigned int)topicLen,
                  (unsigned int)payloadLen,
                  (unsigned int)estPacketLen,
                  (unsigned int)MQTT_BUFFER_BYTES);
  }

  bool ok = mqtt_client.publish(MQTT_TOPIC, payload, payloadLen);
  Serial.printf("[PUB] ok=%u seq=%lu ts=%lu gpsFix=%u gpsTs=%u lat=%.6f lon=%.6f speed=%.2f\n",
                ok ? 1 : 0,
                (unsigned long)pkt.seq,
                (unsigned long)ts,
                gpsFix ? 1 : 0,
                usedGpsTime ? 1 : 0,
                lat,
                lon,
                speedKph);
  if (!ok) {
    Serial.printf("[PUB] Failed, mqtt_state=%d topicLen=%u payloadLen=%u estPacket=%u buffer=%u\n",
                  mqtt_client.state(),
                  (unsigned int)topicLen,
                  (unsigned int)payloadLen,
                  (unsigned int)estPacketLen,
                  (unsigned int)MQTT_BUFFER_BYTES);
  }
  return ok;
}

void servicePublish(unsigned long nowMs) {
  if (!publishPending) return;
  if (!mqtt_client.connected()) return;
  if (nowMs - lastPublishMs < MIN_PUBLISH_GAP_MS) return;

  lastPublishMs = nowMs;

  if (publishTelemetry(publishPacketData)) {
    publishPending = false;
  }
}

// -----------------------------------------------------------------------------
// Setup / loop
// -----------------------------------------------------------------------------

void setup() {
  Serial.begin(DEBUG_BAUD);
  delay(400);
  bootMs = millis();

  Serial.println("\n=== Smart Cargo Gateway Boot ===");
  Serial.println("Design: ESP32 SSLClient/BearSSL TLS + SIM800L MQTT, WiFi OTA HTTP");
  Serial.printf("[FW] Build=%s\n", FIRMWARE_BUILD);
  Serial.printf("[CFG] APN=%s\n", APN);
  Serial.printf("[CFG] Topic=%s\n", MQTT_TOPIC);
  Serial.printf("[CFG] Broker host=%s port=%u\n", MQTT_BROKER_HOST, MQTT_BROKER_PORT);

  // Must be configured before SerialAT.begin()
  SerialAT.setRxBufferSize(SERIAL_AT_RX_BUFFER_BYTES);
  SerialAT.begin(MODEM_BAUD, SERIAL_8N1, PIN_GSM_RX, PIN_GSM_TX);
  for (size_t i = 0; i < (sizeof(GPS_BAUD_CANDIDATES) / sizeof(GPS_BAUD_CANDIDATES[0])); ++i) {
    if (GPS_BAUD_CANDIDATES[i] == GPS_BAUD) {
      gpsBaudCandidateIndex = i;
      break;
    }
  }
  for (size_t i = 0; i < (sizeof(GPS_UART_PIN_CANDIDATES) / sizeof(GPS_UART_PIN_CANDIDATES[0])); ++i) {
    if (GPS_UART_PIN_CANDIDATES[i][0] == PIN_GPS_RX && GPS_UART_PIN_CANDIDATES[i][1] == PIN_GPS_TX) {
      gpsPinCandidateIndex = i;
      break;
    }
  }
  beginGpsUart(GPS_BAUD, PIN_GPS_RX, PIN_GPS_TX);

  // Optional modem DNS override for better reliability
  SerialAT.println("AT+CDNSCFG=\"8.8.8.8\",\"8.8.4.4\"");

  WiFi.persistent(false);
  WiFi.onEvent(onWifiEvent);
  WiFi.setSleep(false);
  WiFi.setAutoReconnect(true);
  initEspNow();
  wifiPrefsReady = wifiPrefs.begin("wificfg", false);
  mqtt_client.setCallback(onMqttMessage);
  attemptStoredWifiConnect();

  if (!ensureModemReady()) {
    Serial.println("[GSM] Modem not ready at boot; loop will retry.");
  }
}

void loop() {
  const unsigned long nowMs = millis();

  gpsPump();
  gpsMaybeScanBaud(nowMs);
  mqtt_client.loop();
  processWifiTasks(nowMs);
  processPendingOta();

  CargoPacket pkt{};
  if (consumePacket(pkt)) {
    publishPacketData = pkt;
    publishPending = true;
    Serial.printf("[ESP-NOW] RX seq=%lu temp=%.2f hum=%.2f pressure=%.2f tilt=%.2f gasRaw=%u gasPpm=%.2f shock=%u sdOk=%u\n",
                  (unsigned long)pkt.seq,
                  pkt.tempC,
                  pkt.humidity,
                  pkt.pressure,
                  pkt.tilt,
                  (unsigned int)pkt.gasRaw,
                  pkt.gasPpm,
                  pkt.shock ? 1 : 0,
                  pkt.sdOk ? 1 : 0);
  }

  maintainConnectivity(nowMs);
  servicePublish(nowMs);
  broadcastTimeSync(nowMs);

  if (nowMs - lastStatusLogMs >= STATUS_LOG_INTERVAL_MS) {
    lastStatusLogMs = nowMs;
    Serial.printf("[STATUS] net=%u gprs=%u mqtt=%u wifi=%s gpsFix=%u sats=%lu gpsAgeMs=%lu gpsChars=%lu nmeaOk=%lu nmeaBad=%lu gpsBaud=%lu gpsRx=%d gpsTx=%d pending=%u dropMac=%lu dropLen=%lu\n",
                  modem.isNetworkConnected() ? 1 : 0,
                  modem.isGprsConnected() ? 1 : 0,
                  mqtt_client.connected() ? 1 : 0,
                  wifiStateName(wifiState),
                  gps.location.isValid() ? 1 : 0,
                  (unsigned long)(gps.satellites.isValid() ? gps.satellites.value() : 0),
                  (unsigned long)(gps.location.isValid() ? gps.location.age() : 0),
                  (unsigned long)gps.charsProcessed(),
                  (unsigned long)gps.passedChecksum(),
                  (unsigned long)gps.failedChecksum(),
                  (unsigned long)gpsActiveBaud,
                  gpsActiveRxPin,
                  gpsActiveTxPin,
                  publishPending ? 1 : 0,
                  (unsigned long)rejectedMacCount,
                  (unsigned long)rejectedLengthCount);

    if (!gps.location.isValid() && (nowMs - bootMs) >= GPS_WARMUP_MS) {
      if (gps.charsProcessed() == 0) {
        Serial.println("[GPS] No UART bytes seen. Check GPS TX->ESP RX wiring and module baud/protocol.");
      } else if (gps.passedChecksum() == 0 && gps.failedChecksum() == 0) {
        Serial.println("[GPS] UART bytes seen but no NMEA frames parsed. Module may be UBX-only or wrong baud.");
      } else {
        Serial.println("[GPS] NMEA is parsing but no location fix yet. Move antenna to open sky and wait.");
      }
    }
  }
}
